package enum

// OcpcTransType 目标转化
type OcpcTransType Enum[int]

func (e OcpcTransType) Values() []OcpcTransType {
	return []OcpcTransType{
		{1, "咨询按钮点击"},
		{10, "购买成功"},
		{1000, "销售线索"},
		{11, "注册"},
		{12, "沟通"},
		{13, "下单"},
		{14, "订单提交成功"},
		{17, "三句话咨询"},
		{18, "留线索"},
		{19, "一句话咨询"},
		{2, "电话按钮点击"},
		{20, "深度页面访问"},
		{25, "注册"},
		{26, "付费"},
		{3, "表单提交成功"},
		{30, "电话拨通"},
		{35, "微信复制按钮点击"},
		{4, "APP激活"},
		{41, "申请"},
		{42, "授信"},
		{45, "商品下单成功"},
		{46, "加入购物车"},
		{47, "商品收藏"},
		{48, "商品详情页"},
		{5, "表单按钮点击"},
		{55, "完件"},
		{57, "店铺调起"},
		{6, "下载(预约)按钮点击"},
		{67, "微信按钮调起点击"},
		{68, "粉丝关注成功"},
		{71, "应用调起"},
		{78, "店铺停留"},
		{79, "微信加粉成功"},
		{80, "直播间成单"},
		{82, "直播间观看"},
		{83, "直播间商品按钮点击"},
		{84, "直播间停留"},
		{85, "直播间评论"},
		{86, "直播间打赏"},
		{87, "直播间购物袋点击"},
		{999999, "多目标转化"},
	}
}

func (e *OcpcTransType) UnmarshalJSON(b []byte) error {
	v, err := UnmarshalJSON[int](b)
	if err != nil {
		return err
	}
	*e = OcpcTransType(v)
	return nil
}
