package enum

// ProductSegment 组件类型
type ProductSegment Enum[int]

func (e ProductSegment) Values() []ProductSegment {
	return []ProductSegment{
		{1040, "交通票务列表"},
		{11006, "全息图文"},
		{11007, "商品橱窗"},
		{11009, "商品精选"},
		{11014, "全息"},
		{11015, "商品列表"},
		{11021, "单品橱窗"},
		{11023, "图文商品列表"},
		{11026, "单品爆款橱窗"},
		{11028, "横划大卡片橱窗"},
		{11029, "文本横划"},
		{11031, "智选列表"},
		{11033, "结构化列表"},
		{11034, "全息服务直达"},
		{11035, "智选列表服务直达"},
		{11037, "站内直达高级版"},
		{11038, "知识直达"},
		{11041, "全息摘要"},
		{11043, "单品多图"},
		{11044, "商品卡片精选"},
		{11045, "商品卡片"},
		{11052, "单品大图"},
		{11055, "活动大图"},
		{11058, "类目橱窗"},
		{11059, "搜索推广头条"},
		{11061, "导航"},
		{11063, "站内直达"},
		{11069, "横图卡片"},
		{11072, "百科服务化"},
		{3037, "全景橱窗"},
		{3198, "热点橱窗"},
	}
}

func (e *ProductSegment) UnmarshalJSON(b []byte) error {
	value, err := UnmarshalJSON[int](b)
	if err != nil {
		return err
	}
	*e = ProductSegment(value)
	return nil
}
